Repository: akinkutlu1/medisafe
Catalog: lib/l10n/app_*.arb
Languages: ru, tr

source: Settings
ru: Настройки
tr: Ayarlar

source: Theme
ru: Тема
tr: Tema

source: Language
ru: Язык
tr: Dil

source: Light Theme
ru: Светлая тема
tr: Açık Tema

source: Dark Theme
ru: Темная тема
tr: Koyu Tema

source: System Theme
ru: Системная тема
tr: Sistem Teması

source: Turkish
ru: Турецкий
tr: Türkçe

source: English
ru: Английский
tr: İngilizce

source: Russian
ru: Русский
tr: Rusça

source: Arabic
ru: Арабский
tr: Arapça

source: Notifications
ru: Уведомления
tr: Bildirimler

source: Reminders and alerts
ru: Напоминания и оповещения
tr: Hatırlatmalar ve uyarılar

source: Background Permissions
ru: Разрешения фона
tr: Arka Plan İzinleri

source: Battery Optimization
ru: Оптимизация батареи
tr: Pil Optimizasyonu

source: Notification Permission
ru: Разрешение уведомлений
tr: Bildirim İzni

source: Exact Alarm Permission
ru: Разрешение точных будильников
tr: Tam Zamanlı Alarm İzni

source: Physical Device Alarms
ru: Будильники на физических устройствах
tr: Fiziksel Cihazlarda Alarmlar

# batteryOptInfo
source: For alarms to work: • Turn off battery optimization • Enable notification permissions • Add app to "Protected apps" list • Disable device background restrictions
ru: Для работы будильников: • Отключите оптимизацию батареи • Включите разрешения уведомлений • Добавьте приложение в список "Защищенные приложения" • Отключите ограничения фона устройства
tr: Alarmların çalışması için: • Pil optimizasyonunu kapatın • Bildirim izinlerini açın • Uygulamayı "Korunan uygulamalar" listesine ekleyin • Cihazınızın arka plan kısıtlamalarını kapatın

# appAbout
source: About App
ru: О приложении
tr: Uygulama Hakkında

source: Sign Out
ru: Выйти
tr: Oturumu Kapat

# signOutConfirm
source: Are you sure you want to sign out of your account?
ru: Вы уверены, что хотите выйти из своей учетной записи?
tr: Hesabınızdan çıkmak istediğinizden emin misiniz?

source: Cancel
ru: Отмена
tr: İptal

source: Confirm
ru: Подтвердить
tr: Onayla

source: Guest
ru: Гость
tr: Misafir

source: Not logged in
ru: Не вошли в систему
tr: Giriş yapmadınız

# errorSigningOut
source: An error occurred while signing out
ru: Произошла ошибка при выходе
tr: Çıkış yapılırken bir hata oluştu

source: Off
ru: Выключено
tr: Kapalı

source: On
ru: Включено
tr: Açık

source: Recommended
ru: Рекомендуется
tr: Önerilen

# alarmsWontWork
source: Alarms may not work
ru: Будильники могут не работать
tr: Alarmlar çalışmayabilir

# alarmsMayDelay
source: Alarms may be delayed
ru: Будильники могут задерживаться
tr: Alarmlar gecikebilir

# medicineNotFound
source: Medicine information not found
ru: Информация о лекарстве не найдена
tr: İlaç bilgisi bulunamadı

# cannotOpenAlarm
source: Cannot open alarm screen
ru: Не удается открыть экран будильника
tr: Alarm ekranı açılamadı

source: Go Back
ru: Назад
tr: Geri Dön

# manageMedicines
source: Manage Your Medicines
ru: Управляйте своими лекарствами
tr: İlaçlarını yönet

# manageMedicinesDescription
source: Add your medicines, receive timely reminders and track your health.
ru: Добавьте свои лекарства, получайте своевременные напоминания и отслеживайте свое здоровье.
tr: İlaçlarınızı ekleyin, zamanında hatırlatmalar alın ve sağlığınızı takip edin.

source: Home
ru: Главная
tr: Ana Sayfa

source: Add Medicine
ru: Добавить лекарство
tr: İlaç Ekle

source: History
ru: История
tr: Geçmiş

source: Healthy Living
ru: Здоровый образ жизни
tr: Sağlıklı Yaşam

source: Medicines
ru: Лекарства
tr: İlaçlar

source: Add New Medicine
ru: Добавить новое лекарство
tr: Yeni İlaç Ekle

# fillInfoAndSave
source: Fill in the information and save
ru: Заполните информацию и сохраните
tr: Bilgileri doldurun ve kaydedin

source: Start Date
ru: Дата начала
tr: Başlangıç Günü

source: End Date
ru: Дата окончания
tr: Bitiş Günü

source: Name
ru: Название
tr: Adı

source: Enter medicine name
ru: Введите название лекарства
tr: İlaç adını yazın

source: Required
ru: Обязательно
tr: Gerekli

source: Type
ru: Тип
tr: Tür

# selectType
source: Select a type
ru: Выберите тип
tr: Bir tür seçin

source: Tablet
ru: Таблетка

source: Syrup
ru: Сироп
tr: Şurup

source: Capsule
ru: Капсула
tr: Kapsül

source: Injection
ru: Инъекция
tr: Enjeksiyon

source: Reminders
ru: Напоминания
tr: Hatırlatıcı

source: Hourly
ru: Почасовой
tr: Saatlik

source: Meal-based
ru: По приему пищи
tr: Öğünlere göre

source: Interval
ru: Интервал
tr: Aralık

# hours
source: h
ru: ч
tr: sa

source: Meal Times
ru: Время приема пищи
tr: Öğün Saatleri

source: Morning
ru: Утром
tr: Sabah

source: Afternoon
ru: Днем
tr: Öğle

source: Evening
ru: Вечером
tr: Akşam

# alarmEnabled
source: Alarm On
ru: Будильник включен
tr: Alarm Açık

source: Save
ru: Сохранить
tr: Kaydet

source: Scan from Camera
ru: Сканировать с камеры
tr: Kameradan Tara

source: Text not detected
ru: Текст не обнаружен
tr: Metin tespit edilemedi

# cameraReadFailed
source: Camera reading failed
ru: Чтение с камеры не удалось
tr: Kamera ile okuma başarısız oldu

source: Session required
ru: Требуется сессия
tr: Oturum gerekli

source: Select at least one meal
ru: Выберите хотя бы один прием пищи
tr: En az bir öğün seçin

# endDateCannotBeBeforeStart
source: End date cannot be before start date
ru: Дата окончания не может быть раньше даты начала
tr: Bitiş günü başlangıçtan önce olamaz

source: Setting up alarm...
ru: Настройка будильника...
tr: Alarm ayarlanıyor...

source: Medicine saved
ru: Лекарство сохранено
tr: İlaç kaydedildi

source: Could not save
ru: Не удалось сохранить
tr: Kaydedilemedi

# takeMedicine
source: Take your medicine
ru: Примите лекарство
tr: İlacınızı alınız

source: Take after meal
ru: Принимайте после еды
tr: Öğünden sonra alın

source: Login
ru: Войти
tr: Giriş Yap

source: Email
ru: Электронная почта
tr: E-posta

source: Password
ru: Пароль
tr: Şifre

source: Forgot Password
ru: Забыли пароль
tr: Şifremi Unuttum

# dontHaveAccount
source: Don't have an account?
ru: Нет аккаунта?
tr: Hesabınız yok mu?

source: Register
ru: Регистрация
tr: Kayıt Ol

source: Register Now
ru: Зарегистрироваться сейчас
tr: Şimdi Kayıt Ol

# alreadyHaveAccount
source: Already have an account?
ru: Уже есть аккаунт?
tr: Zaten hesabınız var mı?

source: Login Now
ru: Войти сейчас
tr: Şimdi Giriş Yap

# enterEmail
source: Enter your email address
ru: Введите ваш email
tr: E-posta adresinizi girin

# enterPassword
source: Enter your password
ru: Введите ваш пароль
tr: Şifrenizi girin

source: Sign in with Google
ru: Войти через Google
tr: Google ile Giriş Yap

source: Welcome
ru: Добро пожаловать
tr: Hoş Geldiniz

source: Get Started
ru: Начать
tr: Başlayın

source: Next
ru: Далее
tr: İleri

source: Done
ru: Готово
tr: Tamam

source: Skip
ru: Пропустить
tr: Atla

source: Select Time
ru: Выбрать время
tr: Saat Seç

source: Alarms
ru: Будильники
tr: Alarmlar

# addNewMedicineButton
source: Add New Medicine
ru: Добавить новое лекарство
tr: Yeni ilaç ekle

source: Login required
ru: Требуется вход в систему
tr: Giriş yapılmalı

# historyTitle
source: History
ru: История
tr: Geçmiş

source: Options
ru: Опции
tr: Seçenekler

source: Clear
ru: Очистить
tr: Temizle

# viewAll
source: View All History
ru: Посмотреть всю историю
tr: Tüm geçmişi gör

# healthyLivingTitle
source: Healthy Living
ru: Здоровый образ жизни
tr: Sağlıklı Yaşam

source: Daily Tips
ru: Ежедневные советы
tr: Günlük İpuçları

source: Current News
ru: Текущие новости
tr: Güncel Haberler

# healthyLivingMessage
source: Take small steps for a better life. Take good care of yourself today!
ru: Делайте маленькие шаги для лучшей жизни. Позаботьтесь о себе сегодня!
tr: Daha iyi bir yaşam için küçük adımlar atın. Bugün kendinize iyi bakın!

source: Increase water intake
ru: Увеличьте потребление воды
tr: Su tüketimini artırın

# waterIntakeDescription
source: Drinking 6-8 glasses of water a day improves mental and physical performance.
ru: Употребление 6-8 стаканов воды в день улучшает умственную и физическую работоспособность.
tr: Günde 6-8 bardak su içmek zihinsel ve fiziksel performansı artırır.

# thirtyMinutesExercise
source: 30 minutes of movement
ru: 30 минут движения
tr: 30 dakika hareket

# exerciseDescription
source: Light-paced daily walking supports heart health.
ru: Ежедневная ходьба в легком темпе поддерживает здоровье сердца.
tr: Her gün hafif tempolu yürüyüş kalp sağlığını destekler.

source: Regular sleep
ru: Регулярный сон
tr: Düzenli uyku

# sleepDescription
source: 7-8 hours of sleep strengthens the immune system.
ru: 7-8 часов сна укрепляют иммунную систему.
tr: 7-8 saat uyku bağışıklık sistemini güçlendirir.

# vegetablesAndFruits
source: Vegetables & fruits
ru: Овощи и фрукты
tr: Sebze & meyve

# vegetablesDescription
source: Colorful plates provide more vitamins and fiber.
ru: Разноцветные блюда обеспечивают больше витаминов и клетчатки.
tr: Renkli tabaklar daha fazla vitamin ve lif sağlar.

# whoPhysicalActivityUpdate
source: WHO: Physical activity guidelines updated
ru: ВОЗ: Обновлены рекомендации по физической активности
tr: DSÖ: Fiziksel aktivite rehberi güncellendi

# smartWatchSleep
source: Sleep tracking with smartwatches: What to pay attention to?
ru: Отслеживание сна с помощью умных часов: На что обратить внимание?
tr: Akıllı saatlerle uyku takibi: Nelere dikkat etmeli?

# omega3HeartHealth
source: New meta-analysis on Omega-3 and heart health
ru: Новый мета-анализ об Омега-3 и здоровье сердца
tr: Omega-3 ve kalp sağlığı üzerine yeni meta-analiz

# currentHealthSource
source: Current Health
ru: Текущее здоровье
tr: Güncel Sağlık

# techHealthSource
source: Tech Health
ru: Технологии здоровья
tr: Tekno Sağlık

# medicalWorldSource
source: Medical World
ru: Медицинский мир
tr: Tıp Dünyası

# readingTime
source: {minutes} min
ru: {minutes} мин
tr: {minutes} dk

# historyInfoMessage
source: This list shows records remaining after clearing. For full history, go to "View All History" from the top right.
ru: В этом списке отображаются записи, оставшиеся после очистки. Для полной истории перейдите в "Посмотреть всю историю" в правом верхнем углу.
tr: Bu listede temizledikten sonra kalan kayıtlar görünür. Tüm geçmiş için sağ üstten "Tüm geçmişi gör"e gidin.

# historyCleared
source: History cleared. Data continues to be stored.
ru: История очищена. Данные продолжают храниться.
tr: Geçmiş temizlendi. Veriler saklanmaya devam ediyor.

# noHistoryYet
source: No history records yet
ru: Пока нет записей истории
tr: Henüz bir geçmiş kaydı yok

# historyDataKeptMessage
source: When this screen is cleared, data continues to be kept in the database.
ru: При очистке этого экрана данные продолжают храниться в базе данных.
tr: Bu ekran temizlendiğinde veriler veritabanında tutulmaya devam eder.

# cannotLoadHistory
source: Could not load history information
ru: Не удалось загрузить информацию об истории
tr: Geçmiş bilgisi alınamadı

# historyLoadFailed
source: Failed to load history
ru: Не удалось загрузить историю
tr: Geçmiş yüklenemedi

# splashMessage1
source: Take your medicines on time, protect your health.
ru: Принимайте лекарства вовремя, защищайте свое здоровье.
tr: İlaçlarını zamanında al, sağlığını koru.

# splashMessage2
source: We're here for your health.
ru: Мы здесь для вашего здоровья.
tr: Sağlığın için buradayız.

# splashMessage3
source: Don't forget your medicine, make your life easier.
ru: Не забывайте о лекарствах, упростите свою жизнь.
tr: İlacını unutma, hayatını kolaylaştır.

# splashMessage4
source: A healthy life, starts with taking medicine on time.
ru: Здоровая жизнь, начинается с приема лекарств вовремя.
tr: Sağlıklı bir yaşam, zamanında alınan ilaçla başlar.

# splashMessage5
source: Health in every dose, peace in every notification.
ru: Здоровье в каждой дозе, спокойствие в каждом уведомлении.
tr: Her dozda sağlık, her bildirimde huzur.

# didYouTakeMedicine
source: Did you take your medicine?
ru: Вы приняли лекарство?
tr: İlaç aldınız mı?

# tookMyMedicine
source: I Took My Medicine
ru: Я принял лекарство
tr: İlacımı Aldım

source: Snooze (30 min)
ru: Отложить (30 мин)
tr: Ertele (30 dk)

# ignoreMarkTaken
source: Ignore (Mark as taken)
ru: Игнорировать (Отметить как принятое)
tr: Yoksay (Aldı say)

# snoozeIgnoreExplanation
source: Snooze option will remind you again in 30 minutes. Ignore option marks as taken.
ru: Отложить напомнит вам снова через 30 минут. Игнорировать отметит как принятое.
tr: Ertele seçeneği 30 dakika sonra sizi tekrar uyarır. Yoksay seçeneği alınmış olarak işaretler.

# connectionTimeout
source: Operation timed out. Please try again.
ru: Операция превысила время ожидания. Пожалуйста, попробуйте снова.
tr: İşlem zaman aşımına uğradı. Lütfen tekrar deneyin.

# checkInternetConnection
source: Check your internet connection
ru: Проверьте ваше интернет-соединение
tr: İnternet bağlantınızı kontrol edin

# generalError
source: An error occurred
ru: Произошла ошибка
tr: Bir hata oluştu

source: Snooze operation failed
ru: Операция отложения не удалась
tr: Erteleme işlemi başarısız

source: Okay
ru: Хорошо
tr: Tamam

source: Processing...
ru: Обработка...
tr: İşleniyor...

source: Not scheduled
ru: Не запланировано
tr: Planlanmadı

source: Now
ru: Сейчас
tr: Şimdi

source: Next alarm
ru: Следующий будильник
tr: Sonraki alarm

# days
source: d
ru: д
tr: g

# minutes
source: m
ru: мин
tr: dk

# seconds
source: s
ru: с
tr: sn

# everyXHours
source: Every {hours} hours
ru: Каждые {hours} часа
tr: {hours} saatte bir

# emailAndPasswordEmpty
source: Email and password fields cannot be empty
ru: Поля электронной почты и пароля не могут быть пустыми
tr: E-posta ve şifre alanları boş olamaz

# loginError
source: An error occurred during login
ru: Произошла ошибка при входе в систему
tr: Giriş yapılırken bir hata oluştu

# userNotFound
source: No user found with this email address
ru: Пользователь с этим адресом электронной почты не найден
tr: Bu e-posta adresi ile kayıtlı kullanıcı bulunamadı

# wrongPassword
source: Incorrect password
ru: Неверный пароль
tr: Şifre hatalı

# invalidEmail
source: Invalid email address
ru: Недопустимый адрес электронной почты
tr: Geçersiz e-posta adresi

# userDisabled
source: This account has been disabled
ru: Этот аккаунт был отключен
tr: Bu hesap devre dışı bırakılmış

# tooManyRequests
source: Too many failed login attempts. Please try again later
ru: Слишком много неудачных попыток входа. Пожалуйста, попробуйте позже
tr: Çok fazla başarısız giriş denemesi. Lütfen daha sonra tekrar deneyin
